import empolyee from '../../assets/images/employee.png'
import Language from '../../assets/images/bamej-and-c-language.png'
import cup from '../../assets/images/cup-of-water-fullsize.png'

export const posts = [
    {
        id: 1,
        title: "التطور الطبيعي للموظف المصري",
        date: " 15/10/2021 ",
        content : "شغل وظيفة جديدة يصاحبها الكثير من الحماس ولا أقصد هنا حماس البدايات، لا بل حماس أسمى من ذلك خاصةً عندما تُقسم بالله أمام بعض المسئولين انك ستراعي الله في العمل ولن تتخاذل في أداء ما عليك...",
        img : empolyee, 
        q1 : " ما هي أحوالك في العمل وهل مازلت مضغوط؟",
        a1 : " لا لم أعد مضغوط في العمل الحمد لله الأوضاع أفضل الآن.",
        q2 : " هل هذا بسبب مكانك الجديد بالعمل أم ماذا؟",
        a2 : " لا.. لا أعتقد هذا، فالكل عمل ولا يختلف مكتب عن آخر كثيراً ولكن أعتقد أن ضميري أصبح في حالة خمول.",
        disc1 : "كان هذا حوار سريع دار بيني وبين خالي في أحد التجمعات العائلية، والذي عاصر معي أزماتي في العمل وساعدني في حلها. ورغم أن السؤال الأخير أجبت عليه على ما يبدو بتلقائية وبسرعة، لكنه شغل تفكيري لنهاية التجمع ولأيام تليها، وآثار تفكيري ما إذا كانت إجابتي صحيحة وتمس الحقيقة أم لا؟",
        tit1 : " شغل وظيفة جديدة",
        disc2 :"يصاحبها الكثير من الحماس ولا أقصد هنا حماس البدايات، لا بل حماس أسمى من ذلك خاصةً عندما تُقسم بالله أمام بعض المسئولين انك ستراعي الله في العمل ولن تتخاذل في أداء ما عليك.",
        disc3:"فهذا يُثقل من قدر الحماس والهمة بمزيد من الدافع للتفاني في العمل بكل ما أوتيت من جهد ووقت، ويصبح ضميرك في أنشط حالاته ويصير بوصلتك في العمل. فالحضور باكراً والانضباط التام في مواعيد العمل لا شيء يذكر، وكذلك العمل لساعات إضافية ليحلّ عليك المساء فهذا يندرج تحت اتقان العمل، وعودتك مرة أخرى للعمل ليلاً فهذا حق العمل عليك. وبالتوازي تجد نبضات ضميرك منتظمة وإن ارتفعت بعض الشيء في بعض الأوقات فهذا لصالح الجميع، وتجد نفسك تؤدي عملك على أكمل وجه وتشعر بالإنجاز وأنك شخص يضيف قيمة للمجتمع.",
        tit2 : " كم هي جميلة البدايات؟",
        disc4 : "لا أعلم. كيف تكون كذلك وجُل ما أصابني من مشكلات كانت في البدايات.",
        disc5:"الموظف المصري في حالة تطور مستمر كالمولود الجديد حتى يهرم، في كل يوم يكتسب جديد ليضفي شيء عليه ـ وأخص هنا المصري لكوني مصرياً وأفتخر -",
        disc6: "هناك العديد من الأسباب التي تغير من شخص الموظف أثناء مسيرة عمله سأذكر منهم أثنين فقط لمستهم بشكل شخصي وبشكل كبير ولن أجعلهم ثلاثة لأبدو شخصاً عميقاً فأنا ليس كذلك:",
        tit3: " أولهما الضغط:",
        disc7 : "كلنا يعلم كم لضغط العمل وضغط الوقت من قوة في التأثير على حياتنا، فجميعنا مررنا بالعديد من الأوقات الصعبة التي كان سببها الرئيسي الضغوطات.",
        disc8:"ولكن أريد أن أخص بالذكر هنا شكل واحد من أشكال الضغوطات وهي ضغط الناس على بعضها، ضغط زملاء العمل على بعضهم. تقاعس بعض الموظفين عن إنهاء مهامهم الموكلة لهم لوجود من يراعي ضميره في العمل، وبالتالي سيتكفل ويُنجز ما أهملوه بدلاً عنهم، هو شكل من أشكال الضغط الذي سيغير مع الوقت شخصية هذا الفرد - الموظف - وكذلك من قدرته النفسية والجسدية على العمل، لاسيما قدرته على إتقان العمل.",
    },
    {
        id: 2,
        title: "منصة برمج ولغة سي C",
        date: " 2/10/2021 ",
        content : "في رحلة بحثي عن طرق دخول هذا العالم التقني المليء بالتعلم والذكاء لم يفاجئني عدد التخصصات والتفرعات والتنوع الهائل في المجالات فهو عالم كبير لا محالة، لكن ما اخذ مني مجهود ووقت هو أختيار الباب أو المدخل الأنسب لي للولوج لهذا العالم الضخم...",
        img : Language
    },
    {
        id: 3,
        title: "نصف الكأس الفارغ له بريق",
        date: " 26/9/2021 ",
        content :'لطالما وقع على مسمعي قول "لا تنظر إلى نصف الكأس الفارغ وانظر إلى نصف الكأس الممتلئ". اتفق مع المقولة وأجدها من أعظم ما قيل عن القناعة والرضا ولا أجد بها خطأ حتى لا تاخذ مقعدها في ساحة قناعاتي، فتجعلني أبحث في داخلي ومن حولي على ما أملكه بالفعل واشرع في إحصائه، وحينها ينتابني شعور بالراحة النفسية، وهذا كل ما اريده أحياناً في مثل تلك الأوقات التي أشعر فيها أني بحاجة للمزيد...',
        img : cup
    }
]