export const posts = [
    {
        id: 1,
        title: "التطور الطبيعي للموظف المصري",
        date: " 15/10/2021 ",
        content : "شغل وظيفة جديدة يصاحبها الكثير من الحماس ولا أقصد هنا حماس البدايات، لا بل حماس أسمى من ذلك خاصةً عندما تُقسم بالله أمام بعض المسئولين انك ستراعي الله في العمل ولن تتخاذل في أداء ما عليك..."
    },
    {
        id: 2,
        title: "منصة برمج ولغة سي C",
        date: " 2/10/2021 ",
        content : "في رحلة بحثي عن طرق دخول هذا العالم التقني المليء بالتعلم والذكاء لم يفاجئني عدد التخصصات والتفرعات والتنوع الهائل في المجالات فهو عالم كبير لا محالة، لكن ما اخذ مني مجهود ووقت هو أختيار الباب أو المدخل الأنسب لي للولوج لهذا العالم الضخم..."
    },
    {
        id: 3,
        title: "نصف الكأس الفارغ له بريق",
        date: " 26/9/2021 ",
        content :'لطالما وقع على مسمعي قول "لا تنظر إلى نصف الكأس الفارغ وانظر إلى نصف الكأس الممتلئ". اتفق مع المقولة وأجدها من أعظم ما قيل عن القناعة والرضا ولا أجد بها خطأ حتى لا تاخذ مقعدها في ساحة قناعاتي، فتجعلني أبحث في داخلي ومن حولي على ما أملكه بالفعل واشرع في إحصائه، وحينها ينتابني شعور بالراحة النفسية، وهذا كل ما اريده أحياناً في مثل تلك الأوقات التي أشعر فيها أني بحاجة للمزيد...'
    }
]