
/*
{
    id: 1,
    image: '',
    title: '',
    brief: ''
    date: '',
    url: ''
    paragraphs:
},
*/


const articles = [
    {
        id: 1,
        image: '../../../../public/images/uxwritingar.png',
        title: 'الكتابة لتجربة المستخدم | UX Writing',
        brief: 'متخصص الكتابة لتجربة المستخدم لا يمكن الإستغناء عنه أو استبداله ببديل آلي لأن العامل البشري فيه مهم لما له من حاجه دائمه للإبداع وإظهار الطابع البشري عليه، بجانب مهارة الذكاء العاطفي، والتي لا يملكها الذكاء الاصطناعي. فلا يمكن أبداً بأي حال من الأحوال أتمتة الكتابة لتجربة المستخدم...',
        date: '20/9/2024',
        url: 'ux-writing',
        paragraphs: [
            {
                id: 1,
                title: 'تعريف:',
                text: 'لمن لم يسمع بهذا المصطلح من قبل فهناك تعريف مبسط يوضح ماهية الكتابة لتجربة المستخدم:'
            },
            {
                id: 2,
                title: '',
                text: 'هي فن صياغة النصوص التي تظهر في جميع أنحاء واجهة المستخدم للمنتجات الرقمية كمواقع الإنترنت، تطبيقات الأجهزة المحمولة، إلخ.. - محمود أحمد -'
            },
            {
                id: 3,
                title: 'تختلف الكتابة لتجربة المستخدم عن الكتابة التقليدية (مقالات، موضوعات ومنشورات، إلخ):',
                text: 'بأن الكتابة لتجربة المستخدم تهدف إلى توجيه وتوصيل المستخدم من خلال "واجهة الاستخدام" (موقع، تطبيقات) إلى غايته من الموقع او التطبيق بطريقة بديهية وأسلوب بسيط وواضح.'
            },
            {
                id: 4,
                title: '',
                text: 'من أكثر الدورات التي استفدت منها الفترة الأخيرة دورة الكتابة لتجربة المستخدم التي يقدمها: محمود أحمد مؤسس منصة "الكتابة لتجربة المستخدم بالعربية UX Writing Ar".'
            },
            {
                id: 5,
                title: '',
                text: '*** أنهيت الدورة بنجاح - الثاني مكرر على الدفعة - كم الاستفاده لا يوصف وكم المعلومات كبيراً جداً لم أكن متوقعة؛ خاصةً وهو تخصص جديد في العالم التقني مازال في بدايته، ورغم ذلك عدد المهام التي تندرج تحت مسؤولية كاتب تجربة المستخدم مهوله وخصوصاً أهمية تلك المهام من:'
            },
            {
                id: 6,
                title: '',
                text: '- إجراء تحليلات للمواقع المنافسة.'
            },
            {
                id: 7,
                title: '',
                text: '- تحليل العملاء والمستخدمين (User Persona).'
            },
            {
                id: 8,
                title: '',
                text: '- المشاركة في استراتجية تطوير المحتوى.'
            },
            {
                id: 9,
                title: '',
                text: '- التنسيق مع فريق تصميم واجهة المستخدم (UI).'
            },
            {
                id: 10,
                title: '',
                text: '- تتبع أهداف قابلية الاستخدام.'
            },
            {
                id: 11,
                title: '',
                text: '- إجراء الاختبارات على قابلية الاستخدام (Usability Test) لكل الصفحات على موقع الويب وإنشاء تقرير بالنتائج.'
            },
            {
                id: 12,
                title: 'مجال واعد بشكل كبير',
                text: 'فبالرغم أن هناك العديد من التخصصات في العالم التقني تتلاشى من حولنا نظراً لإمكانية الاستغناء عنها جزئياً أو كلياً لوجود بديل (تكنولوجي آلي) جاهز وسهل الاستخدام مثل "الووردبريس" وأمثاله الذي استحوذ على جزء كبير من سوق بناء المواقع. '
            },
            {
                id: 13,
                title: '',
                text: 'فالشركات لم تعد بحاجة لمتخصصين في إنشاء المواقع أحدهم في الـ Front End وآخر في الـ Back End أو متخصص Full Stack بل مجرد موظف بالشركة لديه معرفة ببعض المعلومات التقنية يكفي لإنشاء موقع بجودة وكفاءة عالية على الووردبريس دون الحاجة لمبرمج صفحات ويب Front End أو Back End.'
            },
            {
                id: 14,
                title: '',
                text: 'لا سيما ما نحو فيه الآن من ذكاء اصطناعي Artificial Intelligence – AI.'
            },
            {
                id: 15,
                title: '',
                text: 'لكن متخصص الكتابة لتجربة المستخدم لا يمكن الإستغناء عنه أو استبداله ببديل آلي لأن العامل البشري فيه مهم لما له من حاجه دائمه للإبداع وإظهار الطابع البشري عليه، بجانب مهارة الذكاء العاطفي، والتي لا يملكها الذكاء الاصطناعي. فلا يمكن أبداً بأي حال من الأحوال أتمتة الكتابة لتجربة المستخدم.'
            },
            {
                id: 16,
                title: 'نظرة على منصة تعلم الكتابة لتجربة المستخدم بالعربية UXWtintingAr',
                text: ''
            },
            {
                id: 17,
                title: 'أكثر ما أعجبني من المنصة',
                text: 'هي متابعتهم المستمر لنا "كخريجين" حتى يومنا هذا رغم تخرجي من المنصة يوم 28 أبريل 2021، لكن لم تنتهي دعوتهم لي لحضور العديد من المحاضرات والجلسات الأونلاين المتخصصة والتي تتمحور حول التخصص من أكثر من جانب. ومن تلك الجلسات التي حصلت عليها بعد الدورة والتي لا يمكن نسيانها جلسة: "التسويق الشخصي | Personal Branding" لما كانت تحويه من نصائح وخطوات فعالة ومجربة تساعد أي شخص لوضع أقدامه على أول الطريق الوظيفي في مجال الكتابة لتجربة المستخدم بل وفي أي مجال تقني.'
            },
            {
                id: 18,
                title: 'أخيراً:',
                text: ''
            },
            {
                id: 19,
                title: '',
                text: ''
            },
            {
                id: 20,
                title: '',
                text: ''
            },
        ],
        qute: 'بمناسبة عيد الميلاد الرابع لمنصة "الكتابة لتجربة المستخدم بالعربية UX Writing Ar" أتوجله إلى فريق العمل بخالص الشكر لما أضافه لي من علم؛ متمنياً لهم كل النجاح والتوفيق...',
        comments: ''
    },

    {
        id: 2,
        image: '../../../../public/images/bamej-and-c-language.png',
        title: 'منصة برمج ولغة سي C',
        brief: 'في رحلة بحثي عن طرق دخول هذا العالم التقني المليء بالتعلم والذكاء لم يفاجئني عدد التخصصات والتفرعات والتنوع الهائل في المجالات فهو عالم كبير لا محالة، لكن ما اخذ مني مجهود ووقت هو أختيار الباب أو المدخل الأنسب لي للولوج لهذا العالم الضخم...',
        date: '2/10/2021',
        url: 'barmej-platform-and-c-language',
        paragraphs: [
            {
                id: 1,
                title: '',
                text: 'لطالما احببت علم البرمجة تلك الشاشة السوداء وما تحمله من سحر وقدره على تسيير أمور عالمنا في عصرنا هذا. فمنذ الصغر حتى يومي هذا تخلل عمري العديد من محاولات تعلم البرمجة. كانت أولها في الـ HTML لتعلم بناء المواقع، ومن ثم محاولة تعلم القليل من لغة JavaScript لبناء أجزاء صغيرة بأول مدونة لي، يليها محاولة لتعلم لغة الـ Python للتحكم بقطعة الراسبيري باي Raspberry Pi.'
            },
            {
                id: 2,
                title: '',
                text: 'كانت كلها خطوات صغيرة في عالم البرمجة فكثيراً ما كان يراودني حلم تعلم البرمجة من وقت لآخر، ويبدو أنه راودني مرة أخرى منذُ أربعة أشهر أو يزيد لتشعل من جديد حبي بالبرمجة. إلا أني أردت هذه المرة أن تكون مختلفة.'
            },
            {
                id: 3,
                title: 'فلتكن خطوات كبيرة:',
                text: 'القراءة والبحث المكثف ـ فيجب التأني هذه المرة ـ العديد من المقالات والفيديوهات العربية منها والإنجليزية لجمع معلومات بقدر كافٍ لبدء رحلتي في تعلم البرمجة بنفسٍ أطول عن المرات السابقة.'
            },
            {
                id: 4,
                title: '',
                text: 'وفي رحلة بحثي عن طرق دخول هذا العالم التقني المليء بالتعلم والذكاء لم يفاجئني عدد التخصصات والتفرعات والتنوع الهائل في المجالات فهو عالم كبير لا محالة، لكن ما اخذ مني مجهود ووقت هو أختيار الباب أو المدخل الأنسب لي للولوج لهذا العالم الضخم.'
            },
            {
                id: 5,
                title: '',
                text: 'فبعد العديد من عمليات البحث عن أفضل الطرق لبدء تعلم البرمجة وفهم أساسيات ومفهوم البرمجة بشكل صحيح، وجدت احد الفيديوهات على اليوتيوب (لا أتذكر مصدرها) وبعض الإجابات على موقع Quora الإنجليزي، يشيرون أصحابها أن أفضل الطرق لفهم البرمجة وفهم طريقة عمل الحاسب الآلي هي تعلم أساسيات البرمجة بلغة C لما لديها من إمكانيات للتحكم بالحاسب الآلي بشكل كبير وقريب وتحكمها بالذاكرة العشوائية الـ RAM وسرعتها في تنفيذ الشفرة البرمجية، وهي أيضاً لغة عالية الكفاءة.'
            },
            {
                id: 6,
                title: '',
                text: 'ولم يتسنى لي البحث عن تعلم لغة سي C حتى أجد المدرب/ عمر الذي يقدم دورة كاملة عن أساسيات لغة السي، لأجد نفسي فيما بعد محظوظاً بوقوع هذه الدورة بين يدي، وكذلك المنصة التي تحتويها والتي تدعى "منصة برمج".'
            },
            {
                id: 7,
                title: 'منصة برمج كما تعرف نفسها:',
                text: '"هي أول منصة تفاعلية باللغة العربية لتعلم البرمجة، بطريقة عملية مبسطة ولجميع المستويات"'
            },
            {
                id: 8,
                title: '',
                text: 'الهدف من إطلاق برمج هو تنمية مهارات البرمجة في العالم العربي، وتطوير جيل جديد من المبرمجين العرب. ومقرها دولة الكويت الشقيقة.'
            },
            {
                id: 9,
                title: '',
                text: 'يوجد بالمنصة العديد من الدورات المجانية في أكثر من مجال برمجي، مثل برمجة تطبيقات الأندرويد بأستخدام لغة الـ Java، وبرمجة تطبيقات الآيفون بإستخدام لغة SWIFT، وبرمجة تطبيقات الويب بإستخدام لغة Django، ودورات أخرى في تعلم لغات البرمجة مثل لغة الـ C و ++C و Python.'
            },
            {
                id: 10,
                title: '',
                text: 'بجانب المعسكرات المدفوعة التي تحتوي على مادة أعمق وبها تركيز أكبر.'
            },
            {
                id: 11,
                title: 'كم أنا ممتن جداً للتعرف على منصة برمج وأن أكون أحد طلابها:',
                text: 'تشبه منصة برمج العديد من المنصات التعليمية المتواجدة على شبكة الأنترنت ومحتواها الـ MOOCs أو الدورات الأونلاين الذي تقدمه يشبه الكثير من الدورات المتواجدة على منصات أو على اليوتيوب.'
            },
            {
                id: 12,
                title: '',
                text: 'لكن هناك ما يميز منصة برمج ويضعها في مكانة جيدة بين المنصات. فمن الأشياء التي لفتت انتباهي بهذه المنصة هي جودة المحتوى المقدم وجودة عرض المحتوى أيضاً (من فيديو وصوت) بجانب بساطة وسهولة تصفح موقع المنصة، بالإضافة للاختبارات والتحديات البرمجية التي تثبت المعلومات أكثر. بإختصار شديد المنصة تقدم محتوى عربي عالي الجودة وثري.'
            },
            {
                id: 13,
                title: 'وما أعجبني حقاً:',
                text: 'وجعلني أكتب هذه المقالة هي "المنهجية"، منهجية التعليم، أو تسلسل المعرفة الذي نفتقده من الكثير من مقدمي التعليم الأونلاين. ولا اقصد هنا التقليل من مجهودات البعض فالكل يجتهد لتقديم محتوى قيم ومفيد للأخرين ويبذلون قدراً كبيراً من وقتهم وجهدهم لإفادة الغير يُحمدوا عليه بكل تأكيد. وقد تعلمت من الدورات الأونلاين الكثير.'
            },
            {
                id: 14,
                title: '',
                text: 'وهناك من يحسن ويمتاز في تقديم المعرفة والعلم مثل منصة برمج. فالمسار الذي أنهيته كان متراتباً بشكل كبير. فلم أجد نفسي أسأل أسئلة شبيهة بـ: عن ماذا يتحدث المدرب؟ هل ذكر شيء من قبل عن هذا المسمى؟! لا لم يذكر. أو غيرها من الأسئلة التي تضعك في منتصف الطريق بلا توجيه.'
            },
            {
                id: 15,
                title: 'لغة سي C Language:',
                text: 'فقد أنهيت الحمد لله على منصة برمج دورة كاملة عن أساسيات البرمجة بإستخدام لغة السي C والتي من الشائع عنها أنها من أكثر اللغات صعوبة، كما أن هناك العديد ممن لا ينصح ببدء رحلة تعلم البرمجة بلغة C لإنها قد تكون البداية والنهاية معاً.'
            },
            {
                id: 16,
                title: '',
                text: 'لكن في رحلة تعلمي لم أواجه هذا بفضل الله عز وجل، ومن ثم بفضل المدرب عمر وطريقة شرحة الواضحة والسلسة، ومنصة برمج. بل وجدت نفسي واقعاً في حب لغة C ولا أريد أن أتخلى عنها رغم صعوبة التمسك في حال أردت الحصول على عمل في مجالات البرمجة.'
            },
            {
                id: 17,
                title: 'أكثر ما أعجبني من المنصة',
                text: 'هي متابعتهم المستمر لنا "كخريجين" حتى يومنا هذا رغم تخرجي من المنصة يوم 28 أبريل 2021، لكن لم تنتهي دعوتهم لي لحضور العديد من المحاضرات والجلسات الأونلاين المتخصصة والتي تتمحور حول التخصص من أكثر من جانب. ومن تلك الجلسات التي حصلت عليها بعد الدورة والتي لا يمكن نسيانها جلسة: "التسويق الشخصي | Personal Branding" لما كانت تحويه من نصائح وخطوات فعالة ومجربة تساعد أي شخص لوضع أقدامه على أول الطريق الوظيفي في مجال الكتابة لتجربة المستخدم بل وفي أي مجال تقني.'
            },
            {
                id: 18,
                title: 'لا أستطيع نكران الجميل:',
                text: 'الذي قدمته لي منصة برمج، وكما قال رسول الله صلى الله عليه وسلم "لا يشكر الله من لا يشكر الناس". فشكراً منصة برمج على ما قدمتهِ لي من تجربة تعلم جيدة وممتعة، وشكر خاص للأستاذ/ عمر على المجهود المبذول منه في تقديم هذا القدر الكبير من المعرفة. وأتطلع لرؤية خطوتكم التالية فإني استبشر بكم خيرا، ودمتم سالمين.'
            },
            {
                id: 19,
                title: 'في النهاية:',
                text: 'لطالما ما أحببت البرمجة كفكرة عامة وكتجربة تعلم واستخدام بسيط لها، فلم أشعر قط بالملل في تعلمها أو حتى في قضاء ساعات في حل تمرين واحد بسيط على موقع مثل HackerRank. أشعر وكأن رأسي منتعشاً بالتفكير فتمر الساعات وأحسبها دقائق.'
            },
            {
                id: 20,
                title: '',
                text: 'أعلم أني مازلت في البداية وأمامي الكثير من الخطوات والمجهود والتحديات حتى يكون لي ولو شيء بسيط مفيد بهذا العالم، أو أن أستطيع حتى أشباع كفاف شغفي بهذا المجال.'
            },
        ],
        qute: 'لحين هذا أرحب بنصائحكم وتوجيهاتكم لي للمضي قدماً في عالم البرمجة ومساعدتي في اتخاذ الخطوة التالية، فمازلت في حيرة من أمري في اختيار تخصص وخارطة طريق. ودمتم في سلام...',
        comments: ''
    },
]

export default articles;