// import uxwritingar from "../../../assets/images/articlesImages/uxwritingar-6.png";
// import employee from "../../../assets/images/articlesImages/employee.png";
// import bamejAndCLanguage from "../../../assets/images/articlesImages/bamej-and-c-language.png";
// import cupOfWaterFullsize from "../../../assets/images/articlesImages/cup-of-water-fullsize.png";


const articles = [
    {
        id: 4,
        image: 'uxwritingar-6.png',
        title: 'كتابة تجربة المستخدم | UX Writing',
        brief: 'متخصص كتابة تجربة المستخدم لا يمكن الإستغناء عنه أو استبداله ببديل آلي لأن العامل البشري فيه مهم لما له من حاجه دائمه للإبداع وإظهار الطابع البشري عليه، بجانب مهارة الذكاء العاطفي، والتي لا يملكها الذكاء الاصطناعي. فلا يمكن أبداً بأي حال من الأحوال أتمتة كتابة تجربة المستخدم...',
        date: '21/9/2024',
        url: 'ux-writing',
        paragraphs: [
            {
                id: 1,
                title: 'تعريف:',
                text: {
                    t1: 'لمن لم يسمع بهذا المصطلح من قبل فهناك تعريف مبسط يوضح ماهية كتابة تجربة المستخدم:',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 2,
                title: '',
                text: {
                    t1: 'هي فن صياغة النصوص التي تظهر في جميع أنحاء واجهة المستخدم للمنتجات الرقمية كمواقع الإنترنت، تطبيقات الأجهزة المحمولة، إلخ..',
                    link: {
                        url: 'https://www.linkedin.com/in/midoodj/',
                        name: '- محمود أحمد -'
                    },
                    t2: ''
                },
            },
            {
                id: 3,
                title: 'تختلف الكتابة لتجربة المستخدم عن الكتابة التقليدية (مقالات، موضوعات ومنشورات، إلخ):',
                text: {
                    t1: 'بأن الكتابة لتجربة المستخدم تهدف إلى توجيه وتوصيل المستخدم من خلال "واجهة الاستخدام" (موقع، تطبيقات) إلى غايته من الموقع او التطبيق بطريقة بديهية وأسلوب بسيط وواضح.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 4,
                title: '',
                text: {
                    t1: 'من أكثر الدورات التي استفدت منها الفترة الأخيرة دورة الكتابة لتجربة المستخدم التي يقدمها: محمود أحمد مؤسس منصة ',
                    link: {
                        url: 'https://uxwritingar.com/',
                        name: '"كتابة تجربة المستخدم بالعربية UX Writing Ar".'
                    },
                    t2: ''
                },
            },
            {
                id: 5,
                title: 'أنهيت الدورة بنجاح - الثاني مكرر على الدفعة -',
                text: {
                    t1: 'كم الاستفاده لا يوصف وكمية المعلومات كبيرةً جداً لم أكن متوقعها؛ خاصةً وهو تخصص جديد في العالم التقني مازال في بدايته، ورغم ذلك عدد المهام التي تندرج تحت مسؤولية كاتب تجربة المستخدم مهوله وخصوصاً أهمية تلك المهام من:',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 6,
                title: '',
                text: {
                    t1: '- إجراء تحليلات للمواقع المنافسة.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 7,
                title: '',
                text: {
                    t1: '- تحليل العملاء والمستخدمين (User Persona).',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 8,
                title: '',
                text: {
                    t1: '- المشاركة في استراتيجية تطوير المحتوى.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 9,
                title: '',
                text: {
                    t1: '- التنسيق مع فريق تصميم واجهة المستخدم (UI).',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 10,
                title: '',
                text: {
                    t1: '- تتبع أهداف قابلية الاستخدام.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 11,
                title: '',
                text: {
                    t1: '- إجراء الاختبارات على قابلية الاستخدام (Usability Test) لكل الصفحات على موقع الويب وإنشاء تقرير بالنتائج.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 12,
                title: 'وإليك العناصر المسؤول عنها كاتب تجربة المستخدم:',
                text: {
                    t1: 'كاتب تجربة المستخدم UX Writer هو المسؤول عن كتابة جميع العناصر النصية التي تظهر في واجهة المستخدم UI للمنتجات الرقمية. بعض هذه العناصر هي:',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 13,
                title: '',
                text: {
                    t1: '(العناوين Headlines - النصوص المصغرة Microcopy - الأزرار Buttuns - الرسائل Messages - الإشعارات Notifications - القوائم Menus - التعليمات Instructions - إلخ…)',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 14,
                title: 'مجال واعد بشكل كبير',
                text: {
                    t1: 'فبالرغم أن هناك العديد من التخصصات في العالم التقني تتلاشى من حولنا نظراً لإمكانية الاستغناء عنها جزئياً أو كلياً لوجود بديل (تكنولوجي آلي) جاهز وسهل الاستخدام مثل "الووردبريس" وأمثاله الذي استحوذ على جزء كبير من سوق بناء المواقع. ',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 15,
                title: '',
                text: {
                    t1: 'فالشركات لم تعد بحاجة لمتخصصين في إنشاء المواقع أحدهم في الـ Front End وآخر في الـ Back End أو متخصص Full Stack بل مجرد موظف بالشركة لديه معرفة ببعض المعلومات التقنية يكفي لإنشاء موقع بجودة وكفاءة عالية على الووردبريس دون الحاجة لمبرمج صفحات ويب Front End أو Back End.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 16,
                title: '',
                text: {
                    t1: 'لا سيما ما نحن فيه الآن من ذكاء اصطناعي Artificial Intelligence – AI.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 17,
                title: '',
                text: {
                    t1: 'لكن متخصص كتابة تجربة المستخدم لا يمكن الإستغناء عنه أو استبداله ببديل آلي لأن العامل البشري فيه مهم لما له من حاجه دائمه للإبداع وإظهار الطابع البشري عليه، بجانب مهارة الذكاء العاطفي، والتي لا يملكها الذكاء الاصطناعي. فلا يمكن أبداً بأي حال من الأحوال أتمتة كتابة تجربة المستخدم.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 18,
                title: 'نظرة على منصة تعلم كتابة تجربة المستخدم بالعربية UXWtintingAr',
                text: {
                    t1: '',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 19,
                title: 'أكثر ما أعجبني من المنصة',
                text: {
                    t1: 'هي متابعتهم المستمر لنا "كخريجين" حتى يومنا هذا رغم تخرجي من المنصة يوم 28 أبريل 2021، لكن لم تنتهي دعوتهم لي لحضور العديد من المحاضرات والجلسات الأونلاين المتخصصة والتي تتمحور حول التخصص من أكثر من جانب. ومن تلك الجلسات التي حصلت عليها بعد الدورة والتي لا يمكن نسيانها جلسة: "التسويق الشخصي | Personal Branding" لما كانت تحويه من نصائح وخطوات فعالة ومجربة تساعد أي شخص لوضع أقدامه على أول الطريق الوظيفي في مجال كتابة تجربة المستخدم بل وفي أي مجال تقني.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 20,
                title: 'أخيراً:',
                text: {
                    t1: '',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 21,
                title: '',
                text: {
                    t1: '',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 22,
                title: '',
                text: {
                    t1: '',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
        ],
        qute: {
            t1: 'بمناسبة عيد الميلاد الرابع لمنصة',
            link: {
                url: 'https://uxwritingar.com/',
                name: '"كتابة تجربة المستخدم بالعربية UX Writing Ar"'
            },
            t2: ' أتوجه إلى فريق العمل بخالص الشكر لما أضافه لي من علم؛ متمنياً لهم كل النجاح والتوفيق...'
        },
        comments: ''
    },

    {
        id: 3,
        image: 'employee.png',
        title: 'التطور الطبيعي للموظف المصري',
        brief: 'شغل وظيفة جديدة يصاحبها الكثير من الحماس ولا أقصد هنا حماس البدايات، لا بل حماس أسمى من ذلك خاصةً عندما تُقسم بالله أمام بعض المسئولين انك ستراعي الله في العمل ولن تتخاذل في أداء ما عليك...',
        date: '15/10/2021',
        url: 'the-natural-development-of-the-egyptian-employee',
        paragraphs: [
            {
                id: 1,
                title: '',
                text: {
                    t1: '* ما هي أحوالك في العمل وهل مازلت مضغوط؟',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 2,
                title: '',
                text: {
                    t1: '- لا لم أعد مضغوط في العمل الحمد لله الأوضاع أفضل الآن.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 3,
                title: '',
                text: {
                    t1: '* هل هذا بسبب مكانك الجديد بالعمل أم ماذا؟',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 4,
                title: '',
                text: {
                    t1: '- لا.. لا أعتقد هذا، فالكل عمل ولا يختلف مكتب عن آخر كثيراً ولكن أعتقد أن ضميري أصبح في حالة خمول.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 5,
                title: '',
                text: {
                    t1: 'كان هذا حوار سريع دار بيني وبين خالي في أحد التجمعات العائلية، والذي عاصر معي أزماتي في العمل وساعدني في حلها. ورغم أن السؤال الأخير أجبت عليه على ما يبدو بتلقائية وبسرعة، لكنه شغل تفكيري لنهاية التجمع ولأيام تليها، وآثار تفكيري ما إذا كانت إجابتي صحيحة وتمس الحقيقة أم لا؟',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 6,
                title: 'شغل وظيفة جديدة',
                text: {
                    t1: 'يصاحبها الكثير من الحماس ولا أقصد هنا حماس البدايات، لا بل حماس أسمى من ذلك خاصةً عندما تُقسم بالله أمام بعض المسئولين انك ستراعي الله في العمل ولن تتخاذل في أداء ما عليك.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 7,
                title: '',
                text: {
                    t1: 'فهذا يُثقل من قدر الحماس والهمة بمزيد من الدافع للتفاني في العمل بكل ما أوتيت من جهد ووقت، ويصبح ضميرك في أنشط حالاته ويصير بوصلتك في العمل. فالحضور باكراً والانضباط التام في مواعيد العمل لا شيء يذكر، وكذلك العمل لساعات إضافية ليحلّ عليك المساء فهذا يندرج تحت اتقان العمل، وعودتك مرة أخرى للعمل ليلاً فهذا حق العمل عليك. وبالتوازي تجد نبضات ضميرك منتظمة وإن ارتفعت بعض الشيء في بعض الأوقات فهذا لصالح الجميع، وتجد نفسك تؤدي عملك على أكمل وجه وتشعر بالإنجاز وأنك شخص يضيف قيمة للمجتمع.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 8,
                title: 'كم هي جميلة البدايات؟',
                text: {
                    t1: 'لا أعلم. كيف تكون كذلك وجُل ما أصابني من مشكلات كانت في البدايات.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 9,
                title: '',
                text: {
                    t1: 'الموظف المصري في حالة تطور مستمر كالمولود الجديد حتى يهرم، في كل يوم يكتسب جديد ليضفي شيء عليه ـ وأخص هنا المصري لكوني مصرياً وأفتخر -',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 10,
                title: '',
                text: {
                    t1: 'هناك العديد من الأسباب التي تغير من شخص الموظف أثناء مسيرة عمله سأذكر منهم أثنين فقط لمستهم بشكل شخصي وبشكل كبير ولن أجعلهم ثلاثة لأبدو شخصاً عميقاً فأنا ليس كذلك:',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 11,
                title: 'أولهما الضغط:',
                text: {
                    t1: 'كلنا يعلم كم لضغط العمل وضغط الوقت من قوة في التأثير على حياتنا، فجميعنا مررنا بالعديد من الأوقات الصعبة التي كان سببها الرئيسي الضغوطات.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 12,
                title: '',
                text: {
                    t1: 'ولكن أريد أن أخص بالذكر هنا شكل واحد من أشكال الضغوطات وهي ضغط الناس على بعضها، ضغط زملاء العمل على بعضهم. تقاعس بعض الموظفين عن إنهاء مهامهم الموكلة لهم لوجود من يراعي ضميره في العمل، وبالتالي سيتكفل ويُنجز ما أهملوه بدلاً عنهم، هو شكل من أشكال الضغط الذي سيغير مع الوقت شخصية هذا الفرد - الموظف - وكذلك من قدرته النفسية والجسدية على العمل، لاسيما قدرته على إتقان العمل.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 13,
                title: 'ثانياً الأحكام المسبقة:',
                text: {
                    t1: 'وسيطول الحديث في هذه النقطة. فالعديد منا عند ذهابه إلى أحد المصالح الحكومية لإنهاء بعض الأوراق يحمل بداخل حكم مسبق عن تصرفات الموظفين، ويسترجع من ذاكرته كل ما ألقيا على مسمعه من قصص وأساطير وتجارب لآخرين عن مدى سوء معاملة الموظفين للمواطنين، وكم هي المعاناة التي تنتظره فور دخوله هذه المصلحة. ومن ثم… يستحضر كل ما لديه من استراتيجيات، الذكي منها والخبيث للنجاةِ بنفسه دون خسائر ـ إنها الحرب يا سادة ـ',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 14,
                title: '',
                text: {
                    t1: 'لا أستطيع إنكار وجود بعض الموظفين سيئِ التصرف أو الكثير منهم، بل ولدي تجربتي الشخصية عند سردها لن تختلف كثيراً عن تجارب الآخرين. هناك العديد من الموظفين تتصف تصرفاتهم وأخلاقهم بالسوء والتي هي في حاجة ماسة للتغيير والتقويم، لا محالة. ولكن من الغريب اننا بالتوازي في طريقنا لخلق عهد جديد من الموظفين الذين ينتهجون نفس الأساليب ويتصفون بذات الصفات السيئة التي من المفترض أننا نسعى لتقليصها قدر الإمكان والتخلص منها.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 15,
                title: 'تخيل معي أخي',
                text: {
                    t1: 'أنك ذاهب إلى أحد المصالح الحكومية بعد أن أعدت أوراقك والعدة والعتاد ومن رباط الخيل لإنهاء بعض الأوراق الشخصية، وتدخل على أحد الموظفين مترقباً وتحمل على وجهك الجدية التامة وأنت تتحسس مسدسك ـ أو دعنا نقول هنا جاهز بالرد المفحم والصوت الأجش - في حال حاول الموظف التلاعب بك وتأخيرك أو تعطيل مصالحك، وأعطيته ورقك. ثم قال لك دعني خمسة دقائق وعد لي…',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 16,
                title: '',
                text: {
                    t1: '-- حاضر…',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 17,
                title: '',
                text: {
                    t1: 'لن يكون ذلك ردك بالطبع فرأسك مشحوناً بالعديد من الأفكار السلبية التي ستسول لك أن الخمسة دقائق هذه تعني خمسة أيام من الكر والفر بين المصالح الحكومية. وسيكون ردك - بصوت غليظ - لماذا خمسة دقائق؟ أريد فقط منك كذا. أو ما شابه ذاك الرد مما تسول لنا بهِ أنفسنا في مثل تلك المواقف. وهناك من يذهب إلى أبعد من ذلك فيشرع في استخدام إحدى الأسلحة الفتاكة "الرشوة"، مما يفتح باباً آخر للفساد الأخلاقي.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 18,
                title: 'استمر في التخيل معي',
                text: {
                    t1: 'وتخيل ان هذا الموظف سعيد الحظ بسماع ردك كان من حديثي العهد بالوظيفة أي جديد، صفحةً بيضاء. ولحسن حظه المفرط كانت تتهافت عليه منذ الصباح تلك الردود الثقيلة… على مدار الأيام هذا كفيل بخلق صورة نمطية سيئة لديه عن طبيعة العملاء أو كما نقول في عملي "الجمهور". فيصبح الموظف صاحب الصفحة البيضاء والصمعة النظيفة والخلق الجيد بسبب ما انهال عليه من ألفاظ وما تعرض له من أفعال، تدريجياً عكس ذلك. موظف سيئ الخلق، غليظ القلب، مرتشي.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 19,
                title: '',
                text: {
                    t1: 'بعد العديد من محاولات جهاز المناعة لديه والمتمثل في ضميره من رفض التغيّر وتجنب اتخاذ هذا النهج في العمل ومحاولة الثبات على الطبع الحسن. لكن سرعان ما يُضم العديد لقائمة الموظفين السيئين التي لدينا.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 20,
                title: '',
                text: {
                    t1: 'ومن ثم يأتي دور ذلك الموظف في خلق تجارب سيئة مرة أخرى لدى المواطنين، وهلم جرا...',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 21,
                title: 'هذا يضعنا في دائرة مفرغة',
                text: {
                    t1: 'لا نهاية لها ولا نعلم من أين بدأت، من الموظف أم من المواطن. لكن الشاهد هنا هو نحن. نحن أبطال تلك القصص والروايات، كنا موظفين عموميين أو عملاء مواطنين نسعى لتخليص بعض الأوراق الحكومية. فالموظف ليس بكائن فضائي أخترق عالمنا و أرغمنا على التعامل معه بل هو أحد أفراد العائلة. نعم أعني ما أقول هو أحد أفراد عائلتك. ويمكنني الجزم أيضاً أنه لا تخلو عائلة إلا ولديها فرد على الأقل يخدم في مصلحة ما (أب، خال، أبن عم، أخو زوجة، زوجة أحد الأقارب،...) فهم منا ونحن منهم.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 22,
                title: '',
                text: {
                    t1: 'ومن هذا المنطلق يسهل علينا النظر إلى الأمور بشكل أفضل، فهناك موظفين جيدين كما هناك أناس جيدين - في عائلتنا - وهناك موظفين يتصفون بالسوء كما هناك أناس يتصفون بالسوء أيضاً. لكن لا أعلم ما الذي يحدد ذاك. ولا أريد أن أنظر للأمور بنظرة فلسفية ـ بالرغم من حبي لفلسفة بعض الأمور ـ والقول أننا بداخلنا الأثنين الجيد والسيء، الخير والشر.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 23,
                title: 'ولكن يمكننا أن نستنتج مما سبق',
                text: {
                    t1: 'أن الجيد والسيء في إنتظار البيئة المناسبة، والحافز الذي يثير أحدهما ليطغى على الأخر ويطفي على طبيعة صاحبهما. فيسهل علينا وضعه في أحد التصنيفين (جيد - سيء). وبالتالي نجد المصالح الحكومية هي بيئة مناسبة لذلك والعلاقات الإنسانية هي أكبر حافز لإتمام العملية.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 24,
                title: '',
                text: {
                    t1: 'التعاملات البشرية اليومية لدى الموظف في بيئة العمل الحكومية كثيرة ومتنوعة خاصة من يتعامل مع الجمهور بشكل مباشر، ويعني ذلك تعرضه لحوافز أكثر تثير عنده الجيد والسيء، أو أحدهما على الآخر كما ذكرنا من قبل. فإذا كانت الحوافز السيئة هي الغالبة فمسألة وقت ويصبح الموظف المتلقي لها مثلها، والعكس بالعكس، ويصبح هذا هو الطور الذي عليه.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 25,
                title: '',
                text: {
                    t1: 'وهذا يطرح أمامنا سؤال: هل يعتبر الموظف مقياس جيد لدراسة المجتمع وتصنيفه مجتمع جيد أم مجتمع سيء؟',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 26,
                title: 'في النهاية:',
                text: {
                    t1: 'الشكل الحالي والانطباع السائد عن الموظف المصري ما هو إلا انعكاس لنا كمجتمع، فهو دائماً في تطور طبيعي نتاجاً لأفعالنا وتصرفاتنا، ولا ألوم أحداً خاصةً فكلنا ساهمنا بشكل أو بآخر في تشكيل شخصية الموظف المصري. أياً ما كنا موظفين نتعامل مع زملائنا في العمل أو مواطنين نتعامل مع الموظفين.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 27,
                title: 'بعض الحلول:',
                text: {
                    t1: 'لا أملك حلول على مستوى الدولة أو على مستوى المجتمع ولكني قد أذكر نفسي وأذكركم ببعض الأمور الصغيرة والبديهيات التي قد تكون لها أثر كبير.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 28,
                title: '',
                text: {
                    t1: '1- إلتزام وإتمام كل فرد ـ موظف - لعمله المكلف به واجب لا مجال للتقاعس فيه.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 29,
                title: '',
                text: {
                    t1: '2- لا عيب في مساعدة الزملاء "إن أردت" - وهذا شرط أن تملك الأختيار بين المساعدة أو الرفض ـ ولكن لا تنجز عمل الغير حتى يطلب منك ذلك بوضوح وأيضاً ليس كلما طلب منك، حتى يصبح واضحاً للجميع ما عليك وما عليهم.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 30,
                title: '',
                text: {
                    t1: '3- عدم الحكم المسبق على الآخرين، ولا نتخذ قصص وتجارب الأخرين بوصلتنا في التعامل، بل يكفي أن تعطينا الحذر.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 31,
                title: '',
                text: {
                    t1: '4- اختيار أحسن الكلام، فما يُلفظ من قول إلا وله أثر كبير على متلقيه. فلم أعد متعجباً من قول رسول الله صلى الله عليه وسلم "الكلمة الطيبة صدقة". كيف لي أن أتعجب من قدر الكلمة عند الله عز وجل وهي لها هذا الأثر الكبير على البشر.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 32,
                title: '',
                text: {
                    t1: '5- التحلي بالصبر مواطناً كنت أو موظفاً.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 33,
                title: 'أخيراً:',
                text: {
                    t1: '',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 34,
                title: '',
                text: {
                    t1: '',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
        ],
        qute: {
            t1: 'أعلم أن علي ما علي وما خفي عني كان أعظم. لكني أحاول قدر الإمكان أن أضع نصب عيني أفعالي وكلامي وأذكر نفسي من وقت لآخر بالأثر الذي قد تؤول إليه الأمور جراء فعلي أو قولي هذا. وإن لم يكن له أثر جلي الأن، فسيكون له ',
            link: {
                url: 'https://ar.wikipedia.org/wiki/%D8%AA%D8%A3%D8%AB%D9%8A%D8%B1_%D8%A7%D9%84%D9%81%D8%B1%D8%A7%D8%B4%D8%A9#:~:text=%D8%AA%D8%B4%D9%8A%D8%B1%20%D8%A7%D9%84%D8%B9%D8%A8%D8%A7%D8%B1%D8%A9%20%D8%A5%D9%84%D9%89%20%D9%81%D9%83%D8%B1%D8%A9%20%D9%85%D9%81%D8%A7%D8%AF%D9%87%D8%A7,%D8%AA%D8%A4%D8%AF%D9%8A%20%D9%85%D8%AC%D9%85%D9%88%D8%B9%D8%A9%20%D9%85%D8%A7%20%D9%85%D9%86%20%D8%A7%D9%84%D8%B8%D8%B1%D9%88%D9%81',
                name: '"أثر الفراشة".'
            },
            t2: 'دمتم في سلام...'
        },
        comments: ''
    },

    {
        id: 2,
        image: 'bamej-and-c-language.png',
        title: 'منصة برمج ولغة سي C',
        brief: 'في رحلة بحثي عن طرق دخول هذا العالم التقني المليء بالتعلم والذكاء لم يفاجئني عدد التخصصات والتفرعات والتنوع الهائل في المجالات فهو عالم كبير لا محالة، لكن ما اخذ مني مجهود ووقت هو أختيار الباب أو المدخل الأنسب لي للولوج لهذا العالم الضخم...',
        date: '2/10/2021',
        url: 'barmej-platform-and-c-language',
        paragraphs: [
            {
                id: 1,
                title: '',
                text: {
                    t1: 'لطالما احببت علم البرمجة تلك الشاشة السوداء وما تحمله من سحر وقدره على تسيير أمور عالمنا في عصرنا هذا. فمنذ الصغر حتى يومي هذا تخلل عمري العديد من محاولات تعلم البرمجة. كانت أولها في الـ HTML لتعلم بناء المواقع، ومن ثم محاولة تعلم القليل من لغة JavaScript لبناء أجزاء صغيرة بأول مدونة لي، يليها محاولة لتعلم لغة الـ Python للتحكم بقطعة الراسبيري باي Raspberry Pi.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 2,
                title: '',
                text: {
                    t1: 'كانت كلها خطوات صغيرة في عالم البرمجة فكثيراً ما كان يراودني حلم تعلم البرمجة من وقت لآخر، ويبدو أنه راودني مرة أخرى منذُ أربعة أشهر أو يزيد لتشعل من جديد حبي بالبرمجة. إلا أني أردت هذه المرة أن تكون مختلفة.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 3,
                title: 'فلتكن خطوات كبيرة:',
                text: {
                    t1: 'القراءة والبحث المكثف ـ فيجب التأني هذه المرة ـ العديد من المقالات والفيديوهات العربية منها والإنجليزية لجمع معلومات بقدر كافٍ لبدء رحلتي في تعلم البرمجة بنفسٍ أطول عن المرات السابقة.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 4,
                title: '',
                text: {
                    t1: 'وفي رحلة بحثي عن طرق دخول هذا العالم التقني المليء بالتعلم والذكاء لم يفاجئني عدد التخصصات والتفرعات والتنوع الهائل في المجالات فهو عالم كبير لا محالة، لكن ما اخذ مني مجهود ووقت هو أختيار الباب أو المدخل الأنسب لي للولوج لهذا العالم الضخم.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 5,
                title: '',
                text: {
                    t1: 'فبعد العديد من عمليات البحث عن أفضل الطرق لبدء تعلم البرمجة وفهم أساسيات ومفهوم البرمجة بشكل صحيح، وجدت احد الفيديوهات على اليوتيوب (لا أتذكر مصدرها) وبعض الإجابات على موقع Quora الإنجليزي، يشيرون أصحابها أن أفضل الطرق لفهم البرمجة وفهم طريقة عمل الحاسب الآلي هي تعلم أساسيات البرمجة بلغة C لما لديها من إمكانيات للتحكم بالحاسب الآلي بشكل كبير وقريب وتحكمها بالذاكرة العشوائية الـ RAM وسرعتها في تنفيذ الشفرة البرمجية، وهي أيضاً لغة عالية الكفاءة.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 6,
                title: '',
                text: {
                    t1: 'ولم يتسنى لي البحث عن تعلم لغة سي C حتى أجد المدرب/ عمر الذي يقدم دورة كاملة عن أساسيات لغة السي، لأجد نفسي فيما بعد محظوظاً بوقوع هذه الدورة بين يدي، وكذلك المنصة التي تحتويها والتي تدعى',
                    link: {
                        url: 'https://www.barmej.com/',
                        name: '"منصة برمج".'
                    },
                    t2: ''
                },
            },
            {
                id: 7,
                title: 'منصة برمج كما تعرف نفسها:',
                text: {
                    t1: '"هي أول منصة تفاعلية باللغة العربية لتعلم البرمجة، بطريقة عملية مبسطة ولجميع المستويات"',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 8,
                title: '',
                text: {
                    t1: 'الهدف من إطلاق برمج هو تنمية مهارات البرمجة في العالم العربي، وتطوير جيل جديد من المبرمجين العرب. ومقرها دولة الكويت الشقيقة.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 9,
                title: '',
                text: {
                    t1: 'يوجد بالمنصة العديد من الدورات المجانية في أكثر من مجال برمجي، مثل برمجة تطبيقات الأندرويد بأستخدام لغة الـ Java، وبرمجة تطبيقات الآيفون بإستخدام لغة SWIFT، وبرمجة تطبيقات الويب بإستخدام لغة Django، ودورات أخرى في تعلم لغات البرمجة مثل لغة الـ C و ++C و Python.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 10,
                title: '',
                text: {
                    t1: 'بجانب المعسكرات المدفوعة التي تحتوي على مادة أعمق وبها تركيز أكبر.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 11,
                title: 'كم أنا ممتن جداً للتعرف على منصة برمج وأن أكون أحد طلابها:',
                text: {
                    t1: 'تشبه منصة برمج العديد من المنصات التعليمية المتواجدة على شبكة الأنترنت ومحتواها الـ MOOCs أو الدورات الأونلاين الذي تقدمه يشبه الكثير من الدورات المتواجدة على منصات أو على اليوتيوب.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 12,
                title: '',
                text: {
                    t1: 'لكن هناك ما يميز منصة برمج ويضعها في مكانة جيدة بين المنصات. فمن الأشياء التي لفتت انتباهي بهذه المنصة هي جودة المحتوى المقدم وجودة عرض المحتوى أيضاً (من فيديو وصوت) بجانب بساطة وسهولة تصفح موقع المنصة، بالإضافة للاختبارات والتحديات البرمجية التي تثبت المعلومات أكثر. بإختصار شديد المنصة تقدم محتوى عربي عالي الجودة وثري.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 13,
                title: 'وما أعجبني حقاً:',
                text: {
                    t1: 'وجعلني أكتب هذه المقالة هي "المنهجية"، منهجية التعليم، أو تسلسل المعرفة الذي نفتقده من الكثير من مقدمي التعليم الأونلاين. ولا اقصد هنا التقليل من مجهودات البعض فالكل يجتهد لتقديم محتوى قيم ومفيد للأخرين ويبذلون قدراً كبيراً من وقتهم وجهدهم لإفادة الغير يُحمدوا عليه بكل تأكيد. وقد تعلمت من الدورات الأونلاين الكثير.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 14,
                title: '',
                text: {
                    t1: 'وهناك من يحسن ويمتاز في تقديم المعرفة والعلم مثل منصة برمج. فالمسار الذي أنهيته كان متراتباً بشكل كبير. فلم أجد نفسي أسأل أسئلة شبيهة بـ: عن ماذا يتحدث المدرب؟ هل ذكر شيء من قبل عن هذا المسمى؟! لا لم يذكر. أو غيرها من الأسئلة التي تضعك في منتصف الطريق بلا توجيه.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 15,
                title: 'لغة سي C Language:',
                text: {
                    t1: 'فقد أنهيت الحمد لله على منصة برمج دورة كاملة عن أساسيات البرمجة بإستخدام لغة السي C والتي من الشائع عنها أنها من أكثر اللغات صعوبة، كما أن هناك العديد ممن لا ينصح ببدء رحلة تعلم البرمجة بلغة C لإنها قد تكون البداية والنهاية معاً.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 16,
                title: '',
                text: {
                    t1: 'لكن في رحلة تعلمي لم أواجه هذا بفضل الله عز وجل، ومن ثم بفضل المدرب عمر وطريقة شرحة الواضحة والسلسة، ومنصة برمج. بل وجدت نفسي واقعاً في حب لغة C ولا أريد أن أتخلى عنها رغم صعوبة التمسك في حال أردت الحصول على عمل في مجالات البرمجة.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 17,
                title: 'أكثر ما أعجبني من المنصة',
                text: {
                    t1: 'هي متابعتهم المستمر لنا "كخريجين" حتى يومنا هذا رغم تخرجي من المنصة يوم 28 أبريل 2021، لكن لم تنتهي دعوتهم لي لحضور العديد من المحاضرات والجلسات الأونلاين المتخصصة والتي تتمحور حول التخصص من أكثر من جانب. ومن تلك الجلسات التي حصلت عليها بعد الدورة والتي لا يمكن نسيانها جلسة: "التسويق الشخصي | Personal Branding" لما كانت تحويه من نصائح وخطوات فعالة ومجربة تساعد أي شخص لوضع أقدامه على أول الطريق الوظيفي في مجال الكتابة لتجربة المستخدم بل وفي أي مجال تقني.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 18,
                title: 'لا أستطيع نكران الجميل:',
                text: {
                    t1: 'الذي قدمته لي منصة برمج، وكما قال رسول الله صلى الله عليه وسلم "لا يشكر الله من لا يشكر الناس". فشكراً منصة برمج على ما قدمتهِ لي من تجربة تعلم جيدة وممتعة، وشكر خاص للأستاذ/ عمر على المجهود المبذول منه في تقديم هذا القدر الكبير من المعرفة. وأتطلع لرؤية خطوتكم التالية فإني استبشر بكم خيرا، ودمتم سالمين.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 19,
                title: 'في النهاية:',
                text: {
                    t1: 'لطالما ما أحببت البرمجة كفكرة عامة وكتجربة تعلم واستخدام بسيط لها، فلم أشعر قط بالملل في تعلمها أو حتى في قضاء ساعات في حل تمرين واحد بسيط على موقع مثل',
                    link: {
                        url: 'https://www.hackerrank.com/',
                        name: 'HackerRank'
                    },
                    t2: 'أشعر وكأن رأسي منتعشاً بالتفكير فتمر الساعات وأحسبها دقائق.'
                },
            },
            {
                id: 20,
                title: '',
                text: {
                    t1: 'أعلم أني مازلت في البداية وأمامي الكثير من الخطوات والمجهود والتحديات حتى يكون لي ولو شيء بسيط مفيد بهذا العالم، أو أن أستطيع حتى أشباع كفاف شغفي بهذا المجال.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
        ],
        qute: {
            t1: 'لحين هذا أرحب بنصائحكم وتوجيهاتكم لي للمضي قدماً في عالم البرمجة ومساعدتي في اتخاذ الخطوة التالية، فمازلت في حيرة من أمري في اختيار تخصص وخارطة طريق. ودمتم في سلام...',
            link: {
                url: '',
                name: ''
            },
            t2: ''
        },
        comments: ''
    },

    {
        id: 1,
        image: 'cup-of-water-fullsize.png',
        title: 'نصف الكأس الفارغ له بريق',
        brief: 'لطالما وقع على مسمعي قول "لا تنظر إلى نصف الكأس الفارغ وانظر إلى نصف الكأس الممتلئ". اتفق مع المقولة وأجدها من أعظم ما قيل عن القناعة والرضا ولا أجد بها خطأ حتى لا تاخذ مقعدها في ساحة قناعاتي، فتجعلني أبحث في داخلي ومن حولي على ما أملكه بالفعل واشرع في إحصائه، وحينها ينتابني شعور بالراحة النفسية، وهذا كل ما اريده أحياناً في مثل تلك الأوقات التي أشعر فيها أني بحاجة للمزيد...',
        date: '26/9/2021',
        url: 'the-half-empty-cup-has-a-luster',
        paragraphs: [
            {
                id: 1,
                title: '',
                text: {
                    t1: 'لطالما وقع على مسمعي قول "لا تنظر إلى نصف الكأس الفارغ وانظر إلى نصف الكأس الممتلئ". اتفق مع المقولة وأجدها من أعظم ما قيل عن القناعة والرضا ولا أجد بها خطأ حتى لا تاخذ مقعدها في ساحة قناعاتي.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 2,
                title: '',
                text: {
                    t1: 'فتجعلني أبحث في داخلي ومن حولي على ما أملكه بالفعل واشرع في إحصائه - وحينها - ينتابني شعور بالراحة النفسية، وهذا كل ما اريده أحياناً في مثل تلك الأوقات التي أشعر فيها أني بحاجة للمزيد.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 3,
                title: '',
                text: {
                    t1: 'لكن سرعان ما يخذلني قلبي ونظري وأجد نفسي محدقاً في نصف الكأس الفارغ؛ وكيف لا ونصف الكأس الفارغ له بريق!',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 4,
                title: 'الحاجة:',
                text: {
                    t1: 'حين أفكر فيما سبق من خطوات وقرارات في الحياة، أجد أنها كلها تتمحور حول السعي لتحصيل درجة، شغل وظيفة، إشباع حاجة، ملء فراغ أو بالأحرى ملء نصف كأسي الفارغ. ولكن هل هناك خطأ في هذا؟ّ لا أعتقد ذاك.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 5,
                title: '',
                text: {
                    t1: 'فملء الفراغ هي بمثابة حاجة، والحاجة هي دافع قولي للإنجاز، فما كان أن يقال "أن الحاجة أم الاختراع"، فدائماً ما يسبق الاختراع أو الإنجاز حاجة لفعل ذلك. بل أجدها أبعد من ذلك، فترى الحاجة هي الدافع الأقوى للمضي قدماً في الحياة. كيف لا وقد خُلقنا وبداخلنا من الحاجة ما لا يحصى عدده. الشرب، الأكل، النوم، الصحة، المال، الزواج، الراحة، العلم، النفوذ، السلطة، الأحترام، التقدير والعديد من الحاجات والرغبات والشهوات التي وضعها الله بداخلنا لاستمرار الحياة على وجه الأرض.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 6,
                title: '',
                text: {
                    t1: 'فما لنا أن نرهق أنفسنا بالاستيقاظ باكراً والذهاب للعمل الذي بطبيعة الحال نكرهه إلا إذا كنا في حاجةٍ إلى مثل إشباع بطوننا التي لا تتسنّ بضع ساعات أو دقائق في الأحرى وتستغيث لنا من الجوع. فدون الحاجة إلى إشباع جوعنا لن تستمر البشرية أكثر من أيام معدودات على وجه البسيطة. إحدى التقديرات تشير إلى أن الإنسان يستطيع العيش بدون طعام لمدة تتراوح بين شهر إلى ثلاث أشهر فقط إن حالفنا الحظ، وفي حال توافر الماء وأن يكون خالياً من الأمراض المزمنة. وقس على ذلك كل ما نحتاج إليه وكل ما نرغب فيه بإختصار شديد.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 7,
                title: 'لا أريد أن أضايقك:',
                text: {
                    t1: 'ولكن ليس هناك طريقة أفضل لقول هذا "سنظل دائماً ننظر إلى نصف الكأس الفارغ مراراً وتكراراً شئنا أم أبينا"؛ وبالتوازي أحياناً كثيرة سننسى نصف الكأس الممتلئ، ما لدينا، ما أنجزنا، ما نمتلكه بالفعل. وهنا مربط الفرس.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 8,
                title: '',
                text: {
                    t1: '       -------------------------------------------------------------------       ',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 9,
                title: '',
                text: {
                    t1: 'أن نستمر بالتحديق في نصف الكأس دون الآخر ـ وأعني هنا النصف الفارغ منه - يضع أمامنا طريقين متطرفين.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 10,
                title: 'إحداهما أعتبره أقصى اليسار:',
                text: {
                    t1: 'دائرة وهمية كئيبة نسميها "الفشل"، فأصعب ما يكون أن تشعر بأنك لم تنجز شيئاً في حياتك في عمرك الذي مضى ولن يعد، ولا تفارقك أفكار مثل لم أحصل على أعلى الدرجات التي تمنيتها في دراستي، لم أحصل على الوظيفة التي أحلم بها، لم اتزوج الفتاة التي أحببتها، بل لم أتزوج بعد، لم أحصل على الوزن المثالي الذي أتطلع إليه؛ يبدو أنني بالفعل "فاشلاً". فهذا محبط لا جدال، وسرعان ما تشعر باليأس وتتوقف عن فعل أي شيء.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 11,
                title: 'والطريق الثاني أعتبره أقصى اليمين:',
                text: {
                    t1: 'وهو لا يقل ظلاماً من الأول فتجد نفسك منساقاً نحو التحصيل، الاستحواذ، التملك، السعي الدؤوب للوصول للمزيد مما تريد، وإن كان في ظاهره الإنجاز فهو لن يكن كذلك حتى يُصبح متحكماً به. ولن يمر وقت طويل حتى تشعر بالتعب وإنهاك النفس والجسد.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 12,
                title: 'فما الحل؟',
                text: {
                    t1: 'لا أومن بالحلول السحرية ولا حتى يثير فضولي قراءة مقال يحمل عنوانه حل سحري أو أحد المصطلحات الرنانه المشابهة لها، وفي المقابل أدعي أني من منتهجي ومحبي المرونة ولو لم أكن من متقنيها، وكما نعلم لكل قاعدة شواذ',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 13,
                title: '',
                text: {
                    t1: 'لذلك أجد الاتزان، الاعتدال أو الوسطية - أياً ما تسميها - هي الحل الجوهري في هذه الحياة وتستحق منا التأمل فيما تحتويه من معان، وفي قناعتي هي "الحل الرباني" الذي خلقهُ الله لنا. ولن أخوض في هذا كثيراً فجميعنا لديه فكرة ولو بسيطة عن الوسطية في الدين.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 14,
                title: '',
                text: {
                    t1: 'فالبنسبة للوسطية في النظر لحياتنا، في كأسنا الجميل هو تقليب النظر بين الفينة والأخرى في نصفي الكأس. الفارغ منه ليكون دافعاً لنا للإنجاز والمضي قدماً، فكيف لنا أن ننجز شيئاً ونحن لا نرى أننا بحاجةٍ إليه؟ّ! والممتلئ منه ليكون داعماً لنا فيما يواجهنا من تعثر وانتكاسات، وفي كثير من الأحيان لنلتقط أنفاسُنا.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 15,
                title: 'فالنهاية:',
                text: {
                    t1: 'نصف الكأس الفارغ براق لامع يخطف القلوب قبل الأبصار ويشاركنا الحاجة إلى المزيد. لا أريد النظر إلى نصف الكأس الفارغ أو "الحاجة" على إنها نقطة ضعف تُنقص منا أو تُقلل بغير قصد من إنجازاتنا، بل فلتكن دائماً "الدافع"، الدافع للتطور للتحسين للارتقاء بالنفس، ومن الناحية الأخرى ليست "لذة عمياء" كمثل كلب يلهث.',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
            {
                id: 16,
                title: '',
                text: {
                    t1: '',
                    link: {
                        url: '',
                        name: ''
                    },
                    t2: ''
                },
            },
        ],
        qute: {
            t1: 'نحن خُلقنا للإنجاز وخُلق معنا كأسنا الفارغ ليكون دافعاً لنا لملئه أو بالأحرى دافعاً لنا لعمارة الأرض. دمتم سالمين...',
            link: {
                url: '',
                name: ''
            },
            t2: ''
        },
        comments: ''
    },
]

export default articles;